ERP/.svn/pristine/ac/ac17abfa510cb8d4a185687570e06fa03863d5d9.svn-base

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="http://203.162.168.170/SendMTAuth/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" targetNamespace="http://203.162.168.170/SendMTAuth/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <s:schema elementFormDefault="qualified" targetNamespace="http://203.162.168.170/SendMTAuth/">
      <s:element name="SendSMS">
        <s:complexType>
          <s:sequence>
            <s:element minOccurs="0" maxOccurs="1" name="account_name" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="account_password" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="User_ID" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Content" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Service_ID" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Command_Code" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Request_ID" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Message_Type" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Total_Message" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Message_Index" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="IsMore" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Content_Type" type="s:string" />
          </s:sequence>
        </s:complexType>
      </s:element>
      <s:element name="SendSMSResponse">
        <s:complexType>
          <s:sequence>
            <s:element minOccurs="1" maxOccurs="1" name="SendSMSResult" type="s:int" />
          </s:sequence>
        </s:complexType>
      </s:element>
      <s:element name="SendSMSAdvert">
        <s:complexType>
          <s:sequence>
            <s:element minOccurs="0" maxOccurs="1" name="account_name" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="account_password" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Phonenumber" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="Message" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="SendFrom" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="CommandCode" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="RequestID" type="s:string" />
          </s:sequence>
        </s:complexType>
      </s:element>
      <s:element name="SendSMSAdvertResponse">
        <s:complexType>
          <s:sequence>
            <s:element minOccurs="1" maxOccurs="1" name="SendSMSAdvertResult" type="s:int" />
          </s:sequence>
        </s:complexType>
      </s:element>
    </s:schema>
  </wsdl:types>
  <wsdl:message name="SendSMSSoapIn">
    <wsdl:part name="parameters" element="tns:SendSMS" />
  </wsdl:message>
  <wsdl:message name="SendSMSSoapOut">
    <wsdl:part name="parameters" element="tns:SendSMSResponse" />
  </wsdl:message>
  <wsdl:message name="SendSMSAdvertSoapIn">
    <wsdl:part name="parameters" element="tns:SendSMSAdvert" />
  </wsdl:message>
  <wsdl:message name="SendSMSAdvertSoapOut">
    <wsdl:part name="parameters" element="tns:SendSMSAdvertResponse" />
  </wsdl:message>
  <wsdl:portType name="Service_SendSMS2Soap">
    <wsdl:operation name="SendSMS">
      <wsdl:input message="tns:SendSMSSoapIn" />
      <wsdl:output message="tns:SendSMSSoapOut" />
    </wsdl:operation>
    <wsdl:operation name="SendSMSAdvert">
      <wsdl:input message="tns:SendSMSAdvertSoapIn" />
      <wsdl:output message="tns:SendSMSAdvertSoapOut" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="Service_SendSMS2Soap" type="tns:Service_SendSMS2Soap">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="SendSMS">
      <soap:operation soapAction="http://203.162.168.170/SendMTAuth/SendSMS" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="SendSMSAdvert">
      <soap:operation soapAction="http://203.162.168.170/SendMTAuth/SendSMSAdvert" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:binding name="Service_SendSMS2Soap12" type="tns:Service_SendSMS2Soap">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="SendSMS">
      <soap12:operation soapAction="http://203.162.168.170/SendMTAuth/SendSMS" style="document" />
      <wsdl:input>
        <soap12:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="SendSMSAdvert">
      <soap12:operation soapAction="http://203.162.168.170/SendMTAuth/SendSMSAdvert" style="document" />
      <wsdl:input>
        <soap12:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="Service_SendSMS2">
    <wsdl:port name="Service_SendSMS2Soap" binding="tns:Service_SendSMS2Soap">
      <soap:address location="http://210.211.101.107/SendMTAuth/SendMT2.asmx" />
    </wsdl:port>
    <wsdl:port name="Service_SendSMS2Soap12" binding="tns:Service_SendSMS2Soap12">
      <soap12:address location="http://210.211.101.107/SendMTAuth/SendMT2.asmx" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>